Revit 2024 API
IFCLogical Enumeration
 A datatype can have values TRUE, FALSE, UNKNOWN or UNSET.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum IFCLogical
Visual Basic
Public Enumeration IFCLogical
Visual C++
public enum class IFCLogical
Members
Member name | Description
False |  False.
Unknown |  Unknown.
True |  True.
Unset |  Unset.
See Also
Autodesk.Revit.DB.IFC Namespace